In [ ]:
print("ok")

In [20]:
people = {
    "first" : ["manash","rahim","sakib"],
    "last" : ["mondal","hasan","rahaman"],
    "email" : ["manash@gmail.com","rahim@yahoo.com","sakib@hotmail.com"]
}

In [ ]:
people

In [ ]:
import pandas as pd

In [71]:
df = pd.DataFrame(people)

In [ ]:
df

In [ ]:
df['email']

In [ ]:
type(df['email'])

In [ ]:
df.email

In [ ]:
df.columns

In [ ]:
df[['first','email']]

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[0,2] #row and col

In [ ]:
df.iloc[[0,1]]

In [ ]:
df.iloc[[0,2]]

In [ ]:
df.iloc[[0,2],2]

In [ ]:
# loc() uses level to access data
df.loc[[0,1],['email']]

In [ ]:
df.loc[[0,1],['email','first']]

In [21]:
df.set_index('email')

                    first     last
email
manash@gmail.com   manash   mondal
rahim@yahoo.com     rahim    hasan
sakib@hotmail.com   sakib  rahaman

In [27]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.set_index('email',inplace=True)

In [29]:
df

                    first     last
email
manash@gmail.com   manash   mondal
rahim@yahoo.com     rahim    hasan
sakib@hotmail.com   sakib  rahaman

In [31]:
df.loc['manash@gmail.com']

first    manash
last     mondal
Name: manash@gmail.com, dtype: object

In [45]:
df.reset_index(inplace = True)

In [46]:
df

   level_0  index              email   first     last
0        0      0   manash@gmail.com  manash   mondal
1        1      1    rahim@yahoo.com   rahim    hasan
2        2      2  sakib@hotmail.com   sakib  rahaman

In [47]:
df.reset_index(inplace = True, drop = True)

In [48]:
df

   level_0  index              email   first     last
0        0      0   manash@gmail.com  manash   mondal
1        1      1    rahim@yahoo.com   rahim    hasan
2        2      2  sakib@hotmail.com   sakib  rahaman

In [50]:
df.set_index('first')

        level_0  index              email     last
first
manash        0      0   manash@gmail.com   mondal
rahim         1      1    rahim@yahoo.com    hasan
sakib         2      2  sakib@hotmail.com  rahaman

In [54]:
df.drop(['index'], axis = 1)  #df.drop(['A'], axis = 1)

   level_0              email   first     last
0        0   manash@gmail.com  manash   mondal
1        1    rahim@yahoo.com   rahim    hasan
2        2  sakib@hotmail.com   sakib  rahaman

In [56]:
df

   level_0  index              email   first     last
0        0      0   manash@gmail.com  manash   mondal
1        1      1    rahim@yahoo.com   rahim    hasan
2        2      2  sakib@hotmail.com   sakib  rahaman

In [57]:
df.drop(['index','level_0'], axis = 1)

               email   first     last
0   manash@gmail.com  manash   mondal
1    rahim@yahoo.com   rahim    hasan
2  sakib@hotmail.com   sakib  rahaman

In [58]:
df

   level_0  index              email   first     last
0        0      0   manash@gmail.com  manash   mondal
1        1      1    rahim@yahoo.com   rahim    hasan
2        2      2  sakib@hotmail.com   sakib  rahaman

In [59]:
df.drop(['index','level_0'], axis = 1,inplace=True)

In [60]:
df

               email   first     last
0   manash@gmail.com  manash   mondal
1    rahim@yahoo.com   rahim    hasan
2  sakib@hotmail.com   sakib  rahaman

In [61]:
df.set_index('first',inplace=True)

In [65]:
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [64]:
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [66]:
df.set_index('first', inplace=True)

In [67]:
df

           last              email
first
manash   mondal   manash@gmail.com
rahim     hasan    rahim@yahoo.com
sakib   rahaman  sakib@hotmail.com

In [68]:
df.sort_index()

           last              email
first
manash   mondal   manash@gmail.com
rahim     hasan    rahim@yahoo.com
sakib   rahaman  sakib@hotmail.com

In [69]:
df.sort_index(ascending=False)

           last              email
first
sakib   rahaman  sakib@hotmail.com
rahim     hasan    rahim@yahoo.com
manash   mondal   manash@gmail.com

In [72]:
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [76]:
df['last']=='hasan'   # return sries of row the string "hasan"

0    False
1     True
2    False
Name: last, dtype: bool